IDENTIFICATION DIVISION.
PROGRAM-ID. MergeFiles.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT BSIT-FILE ASSIGN TO 'BSIT.DAT'
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT BSCS-FILE ASSIGN TO 'BSCS.DAT'
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT MERGED-FILE ASSIGN TO 'MERGED.DAT'
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  BSIT-FILE.
01  BSIT-RECORD.
    05  BSIT-STUDENT-NAME  PIC X(15).
    05  BSIT-GRADE         PIC 999.

FD  BSCS-FILE.
01  BSCS-RECORD.
    05  BSCS-STUDENT-NAME  PIC X(15).
    05  BSCS-GRADE         PIC 999.

FD  MERGED-FILE.
01  MERGED-RECORD.
    05 MERGED-LINE PIC X(80).

WORKING-STORAGE SECTION.
    01  STUDENT-NAME              PIC X(15).
    01  STUDENT-GRADE             PIC 999.
    01  EOF-BSIT                  PIC X VALUE 'N'.
    01  EOF-BSCS                  PIC X VALUE 'N'.
    01  CNTR                      PIC 9(3) VALUE 0.
    01  WS-STUDENT-NAME           OCCURS 100 TIMES PIC X(15).
    01  WS-GRADE                  OCCURS 100 TIMES PIC 999.
    01  WS-SUM-GRADE              PIC 9(5) VALUE 0.
    01  WS-AVG-GRADE              PIC 999V99.
    01  TEMP-NAME                 PIC X(15).
    01  TEMP-GRADE                PIC 999.

    01  HDG-0.
        02 FILLER PIC X(15) VALUE SPACES.
        02 FILLER PIC X(12) VALUE "STUDENT NAME".
        02 FILLER PIC X(13) VALUE SPACES.
        02 FILLER PIC X(5) VALUE "GRADE".

    01  PRINT-OUT.
        02 FILLER PIC X(15) VALUE SPACES.
        02 STUD-NAME-OUT PIC X(15).
        02 FILLER PIC X(10) VALUE SPACES.
        02 GRADE-OUT PIC ZZ9.
    01  FTR-0.
        02 FILLER PIC X(15) VALUE SPACES.
        02 FILLER PIC X(15) VALUE "AVERAGE GRADE: ".
        02 FILLER PIC X(10) VALUE SPACES.
        02 AVERAGE-GRADE-OUT PIC ZZ9.99.
    01  I  PIC 999.
    01  J  PIC 999.
    01 ESCAPE-CODE PIC X VALUE X"1B".
    01 CLEAR-SCREEN-SEQUENCE PIC X(4) VALUE "[2J".  
    01 CURSOR-HOME-SEQUENCE PIC X(3) VALUE "[H".    

PROCEDURE DIVISION.
    PERFORM CLEAR-SCREEN.
    DISPLAY "Enter BSIT Students (NAME & GRADE)." WITH NO ADVANCING.
    DISPLAY " Type 'BSIT' to stop.".
    OPEN OUTPUT BSIT-FILE.
    PERFORM INPUT-STUDENTS1.
    CLOSE BSIT-FILE.

    DISPLAY "Enter BSCS Students (NAME & GRADE)." WITH NO ADVANCING. 
    DISPLAY " Type 'BSCS' to stop.".
    OPEN OUTPUT BSCS-FILE.
    PERFORM INPUT-STUDENTS2.
    CLOSE BSCS-FILE.

    OPEN INPUT BSIT-FILE.
    OPEN INPUT BSCS-FILE.
    OPEN OUTPUT MERGED-FILE.

    PERFORM READ-BSIT-FILE.
    PERFORM READ-BSCS-FILE.
    PERFORM MERGE-SORT-MERGE.
    PERFORM WRITE-MERGED-FILE.

    CLOSE BSIT-FILE.
    CLOSE BSCS-FILE.
    CLOSE MERGED-FILE.
    STOP RUN.

INPUT-STUDENTS1.
    PERFORM UNTIL STUDENT-NAME = "BSIT"
        DISPLAY "Enter Student Name (15 characters max): " WITH NO ADVANCING
        ACCEPT STUDENT-NAME
        PERFORM UNTIL STUDENT-NAME IS ALPHABETIC AND LENGTH OF STUDENT-NAME <= 15
            DISPLAY "Invalid input. Please enter a valid name "
            "(letters only | Max: 15 Characters)"
            DISPLAY "Enter Student Name (15 characters max): " WITH NO ADVANCING
            ACCEPT STUDENT-NAME
        END-PERFORM
        IF STUDENT-NAME NOT = "BSIT"
            DISPLAY "Enter Student Grade (1-100): " WITH NO ADVANCING
            ACCEPT STUDENT-GRADE
            IF FUNCTION TEST-NUMVAL(STUDENT-GRADE) = 0
                AND STUDENT-GRADE IS NUMERIC
                AND STUDENT-GRADE IS POSITIVE
                AND STUDENT-GRADE <= 100
                AND STUDENT-GRADE >= 1
                MOVE STUDENT-NAME TO BSIT-STUDENT-NAME
                MOVE STUDENT-GRADE TO BSIT-GRADE
                WRITE BSIT-RECORD FROM BSIT-RECORD 
            ELSE
                DISPLAY "Invalid Grade. Please enter a number: "
                       WITH NO ADVANCING
                DISPLAY "between 1 and 100."
                DISPLAY "Enter Student Grade (1-100): " WITH NO ADVANCING
                ACCEPT STUDENT-GRADE
            END-IF   
        END-IF
    END-PERFORM.
    PERFORM CLEAR-SCREEN.

INPUT-STUDENTS2.
    PERFORM UNTIL STUDENT-NAME = "BSCS"
        DISPLAY "Enter Student Name (15 characters max): " WITH NO ADVANCING
        ACCEPT STUDENT-NAME
        PERFORM UNTIL STUDENT-NAME IS ALPHABETIC AND LENGTH OF STUDENT-NAME <= 15
            DISPLAY "Invalid input. Please enter a valid name "
            "(letters only | Max: 15 Characters)"
            DISPLAY "Enter Student Name (15 characters max): " WITH NO ADVANCING
            ACCEPT STUDENT-NAME
        END-PERFORM
        IF STUDENT-NAME NOT = "BSCS"
            DISPLAY "Enter Student Grade (1-100): " WITH NO ADVANCING
            ACCEPT STUDENT-GRADE
            IF FUNCTION TEST-NUMVAL(STUDENT-GRADE) = 0
                AND STUDENT-GRADE IS NUMERIC
                AND STUDENT-GRADE IS POSITIVE
                AND STUDENT-GRADE <= 100
                AND STUDENT-GRADE >= 1
                MOVE STUDENT-NAME TO BSCS-STUDENT-NAME
                MOVE STUDENT-GRADE TO BSCS-GRADE
                WRITE BSCS-RECORD FROM BSCS-RECORD 
            ELSE
                DISPLAY "Invalid Grade. Please enter a number: "
                       WITH NO ADVANCING
                DISPLAY "between 1 and 100."
                DISPLAY "Enter Student Grade (1-100): " WITH NO ADVANCING
                ACCEPT STUDENT-GRADE
            END-IF   
        END-IF
    END-PERFORM.
    PERFORM CLEAR-SCREEN.

READ-BSIT-FILE.
    PERFORM UNTIL EOF-BSIT = 'Y'
        READ BSIT-FILE INTO BSIT-RECORD
            AT END
                MOVE 'Y' TO EOF-BSIT
            NOT AT END
                ADD 1 TO CNTR
                MOVE BSIT-STUDENT-NAME TO WS-STUDENT-NAME(CNTR)
                MOVE BSIT-GRADE TO WS-GRADE(CNTR)
                ADD BSIT-GRADE TO WS-SUM-GRADE
        END-PERFORM.

READ-BSCS-FILE.
    PERFORM UNTIL EOF-BSCS = 'Y'
        READ BSCS-FILE INTO BSCS-RECORD
            AT END
                MOVE 'Y' TO EOF-BSCS
            NOT AT END
                ADD 1 TO CNTR
                MOVE BSCS-STUDENT-NAME TO WS-STUDENT-NAME(CNTR)
                MOVE BSCS-GRADE TO WS-GRADE(CNTR)
                ADD BSCS-GRADE TO WS-SUM-GRADE
        END-PERFORM.

MERGE-SORT-MERGE.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I >= CNTR
        PERFORM VARYING J FROM I BY 1 UNTIL J > CNTR
            IF WS-GRADE(I) < WS-GRADE(J) OR
               (WS-GRADE(I) = WS-GRADE(J) AND WS-STUDENT-NAME(I) > WS-STUDENT-NAME(J))
                MOVE WS-STUDENT-NAME(I) TO TEMP-NAME
                MOVE WS-GRADE(I) TO TEMP-GRADE
                MOVE WS-STUDENT-NAME(J) TO WS-STUDENT-NAME(I)
                MOVE WS-GRADE(J) TO WS-GRADE(I)
                MOVE TEMP-NAME TO WS-STUDENT-NAME(J)
                MOVE TEMP-GRADE TO WS-GRADE(J)
            END-IF
        END-PERFORM
    END-PERFORM.

WRITE-MERGED-FILE.
    MOVE HDG-0 TO MERGED-LINE.
    WRITE MERGED-RECORD FROM MERGED-LINE.
    WRITE MERGED-RECORD FROM SPACES.
    
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > CNTR
        MOVE WS-STUDENT-NAME(I) TO STUD-NAME-OUT
        MOVE WS-GRADE(I) TO GRADE-OUT
        MOVE PRINT-OUT TO MERGED-LINE
        WRITE MERGED-RECORD FROM MERGED-LINE
    END-PERFORM.
    COMPUTE WS-AVG-GRADE = WS-SUM-GRADE / CNTR.
    MOVE WS-AVG-GRADE TO AVERAGE-GRADE-OUT.
    WRITE MERGED-RECORD FROM SPACES.
    MOVE FTR-0 TO MERGED-LINE.
    WRITE MERGED-RECORD FROM MERGED-LINE.

CLEAR-SCREEN.
    DISPLAY ESCAPE-CODE UPON CONSOLE.
    DISPLAY CLEAR-SCREEN-SEQUENCE UPON CONSOLE.
    DISPLAY ESCAPE-CODE UPON CONSOLE.
    DISPLAY CURSOR-HOME-SEQUENCE UPON CONSOLE.
    EXIT.
